Repository: alex-bleotu/BlockFund
Catalog: frontend/src/locales/*/messages.po
Languages: ro

source: A platform fee of
ro: O taxă de platformă de

source: A practical example of how blockchain can be used in crowdfunding, perfect for students and developers learning Web3 technologies.
ro: Un exemplu practic de cum blockchain poate fi folosit în strângerea de fonduri, perfect pentru studenți și dezvoltatori care învață tehnologii Web3.

source: About
ro: Despre

source: About BlockFund
ro: Despre BlockFund

source: About the Creator
ro: Despre creator

source: Access denied
ro: Acces refuzat

source: Access funding opportunities from anywhere in the world, breaking down geographical barriers.
ro: Accesează oportunități de finanțare de oriunde din lume, eliminând barierele geografice.

source: Active
ro: Activ

source: ACTIVE
ro: ACTIV

source: Active Campaigns
ro: Campanii active

source: Active Users
ro: Utilizatori activi

source: Add Image
ro: Adaugă imagine

source: Add up to 4 images (PNG or JPG only). First image will be the cover image.
ro: Adaugă până la 4 imagini (PNG sau JPG doar). Prima imagine va fi imaginea de acoperiș.

source: All
ro: Toate

source: All Categories
ro: Toate categoriile

source: All caught up!
ro: Toate notificările au fost citite!

source: All your campaigns have ended. Start a new one!
ro: Toate campaniile tale s-au încheiat. Începe una nouă!

source: Already have an account?
ro: Ai deja un cont?

source: Amount Remaining
ro: Sumă rămasă

source: Amount to Contribute
ro: Sumă de contribuit

source: Amount:
ro: Sumă:

source: An error occurred
ro: A apărut o eroare

source: An error occurred while deleting the message
ro: A apărut o eroare la ștergerea mesajului

source: and help make it a reality
ro: și ajut-o să se facă realitate

source: Are the campaigns real?
ro: Sunt campaniile reale?

source: Are you sure you want to delete
ro: Sunteți sigur că doriți să ștergeți

source: Are you sure you want to mark this campaign as
ro: Sunteți sigur că doriți să marcați această campanie ca

source: Art
ro: Artă

source: At least one campaign image is required
ro: Este necesară cel puțin o imagine de campanie

source: Automated fund distribution and milestone tracking through smart contracts, eliminating intermediaries.
ro: Distribuție automată a fondurilor și urmărire a etapelor prin contracte inteligente, eliminând intermediarii.

source: Back
ro: Înapoi

source: Back to Campaigns
ro: Înapoi la campanii

source: Basics
ro: Baze

source: Bio
ro: Biografie

source: Blockchain Status
ro: Status blockchain

source: Blockchain visualization
ro: Vizualizare blockchain

source: BlockFund is a learning-focused initiative designed to illustrate how blockchain can enhance traditional crowdfunding platforms. Rather than serving as a live funding service, it's a practical example of how blockchain can be used in crowdfunding.
ro: BlockFund este o inițiativă de învățare centrată pe blockchain, care ilustrează cum blockchain poate îmbunătăți platformele de crowdfunding tradiționale. În loc să servească ca un serviciu de strângere de fonduri live, este un exemplu practic de cum blockchain poate fi folosit în crowdfunding.

source: BlockFund. All rights reserved.
ro: BlockFund. Toate drepturile rezervate.

source: Built with React, TypeScript, Tailwind CSS, Supabase, and Ethereum smart contracts to showcase modern development practices.
ro: Construit cu React, TypeScript, Tailwind CSS, Supabase și contracte inteligente Ethereum pentru a arăta practicile de dezvoltare moderne.

source: Call Us
ro: Sună-ne

source: Campaign Category
ro: Categorie campanie

source: Campaign category is required
ro: Categorie campanie este necesară

source: Campaign Completed
ro: Campanie finalizată

source: Campaign Creator
ro: Creatorul campaniei

source: Campaign deadline cannot be more than 2 years in the future
ro: Termenul final al campaniei nu poate fi mai mult de 2 ani în viitor

source: Campaign deadline must be at least 1 week from today
ro: Termenul final al campaniei trebuie să fie cel puțin 1 săptămână de azi

source: Campaign deleted successfully
ro: Campanie ștearsă cu succes

source: Campaign Description
ro: Descriere campanie

source: Campaign description is required
ro: Descrierea campaniei este necesară

source: Campaign End Date
ro: Data finală a campaniei

source: Campaign end date cannot be modified after creation
ro: Data finală a campaniei nu poate fi modificată după creare

source: Campaign Ended
ro: Campanie încheiată

source: Campaign Goal
ro: Obiectiv campanie

source: Campaign ID
ro: ID campanie

source: Campaign Images
ro: Imagini campanie

source: Campaign Information
ro: Informații campanie

source: Campaign is not closed
ro: Campania nu este închisă

source: Campaign is not deployed on blockchain
ro: Campania nu este implementată pe blockchain

source: Campaign must run for at least 1 week from today and no more than 2 years
ro: Campania trebuie să ruleze cel puțin 1 săptămână de azi și nu mai mult de 2 ani

source: Campaign not found
ro: Campania nu există

source: Campaign Summary
ro: Sumar campanie

source: Campaign summary is required
ro: Sumarul campaniei este necesar

source: Campaign Title
ro: Titlu campanie

source: Campaign title is required
ro: Titlul campaniei este necesar

source: Campaign:
ro: Campanie:

source: Campaigns
ro: Campanii

source: Can I actually donate to campaigns?
ro: Pot dona efectiv la campanii?

source: Can I use this for real crowdfunding?
ro: Pot folosi aceasta pentru crowdfunding real?

source: Cancel
ro: Anulează

source: Cannot delete campaign because the raised funds are not yet withdrawn.
ro: Nu poți șterge campania deoarece fondurile colectate nu au fost încă retrase.

source: Categories
ro: Categorii

source: Category
ro: Categorie

source: Change Campaign Status
ro: Schimbă statusul campaniei

source: characters
ro: caractere

source: Check out this campaign on BlockFund
ro: Vezi această campanie pe BlockFund

source: Choose a username
ro: Alege un nume de utilizator

source: Click to view
ro: Click pentru a vedea

source: Close menu
ro: Închide meniul

source: CoinGecko returned {0}
ro: CoinGecko a returnat {0}

source: Collect Campaign Fees
ro: Strânge comisioane de campanie

source: Collect Fees
ro: Comisioane

source: Community
ro: Comunitate

source: Completed
ro: Finalizat

source: Completed
ro: Finalizate

source: Completion:
ro: Finalizare:

source: Confirm
ro: Confirmă

source: Confirm New Password
ro: Confirmă noua parolă

source: Connect Wallet
ro: Conectează portofel

source: Connect with backers and creators from around the world in our vibrant ecosystem.
ro: Conectează-te cu susținători și creatori din întreaga lume în ecosistemul nostru vibrant.

source: Connect With Us
ro: Conectează-te cu noi

source: Connect your MetaMask wallet to start creating campaigns
ro: Conectează-ți portofelul MetaMask pentru a începe crearea campaniilor

source: Connect your Wallet
ro: Conectează portofelul tău

source: Connect Your Wallet
ro: Conectează-ți portofelul

source: Connect your wallet to contribute to this campaign
ro: Conectează-ți portofelul pentru a contribui la această campanie

source: Connected:
ro: Conectat:

source: Connection already in progress. Please check MetaMask.
ro: Conexiune deja în curs. Verifică MetaMask.

source: Contact Creator
ro: Contactează creatorul

source: Contract Address
ro: Adresa contractului

source: Contract address input is only available when using Local network.
ro: Adresa contractului este disponibilă doar când se folosește rețeaua locală.

source: Contract Settings
ro: Setări contract

source: Contribute
ro: Contribuie

source: Contribute to
ro: Contribuie la

source: Contribute to this Campaign
ro: Contribuie la această campanie

source: Contribute to this campaign with ETH.
ro: Contribuie la această campanie cu ETH.

source: Could not close campaign on blockchain. Delete aborted.
ro: Nu a putut închide campania pe blockchain. Ștergerea a fost anulată.

source: Cover Image
ro: Imagine de copertă

source: Create a password
ro: Creează o parolă

source: Create Account
ro: Creează cont

source: Create Campaign
ro: Creează o campanie

source: Create your account
ro: Creează-ți contul

source: Create Your Campaign
ro: Creează-ți campania

source: Creating account...
ro: Se creează contul...

source: Crowdfunding
ro: strânsul de fonduri

source: Current ETH Price:
ro: Prețul curent al ETH:

source: Current Network
ro: Rețea curentă

source: Current Password
ro: Parola curentă

source: Current password is incorrect
ro: Parola curentă este incorectă

source: days left
ro: zile rămase

source: Delete
ro: Șterge

source: Delete Campaign
ro: Șterge campanie

source: Deleting...
ro: Ștergere...

source: Description is limited to
ro: Descrierea este limitată la

source: Disconnect
ro: Deconectează

source: Display Name
ro: Nume afișat

source: Documentation
ro: Documentație

source: Don't actually do that!
ro: De fapt nu face asta!

source: Edit Campaign
ro: Editează campania

source: Education
ro: Educație

source: Educational Focus
ro: Focus educațional

source: Educational Project Disclaimer
ro: Proiect educațional!

source: Email address
ro: Adresă de email

source: Email Us
ro: Trimite-ne un email

source: End Date
ro: Data de încheiere

source: Ended
ro: Încheiat

source: Ended
ro: Încheiate

source: Ended Campaigns
ro: Campanii încheiate

source: Enter subject
ro: Introduceți subiectul

source: Enter your email
ro: Introdu emailul tău

source: Enter your password
ro: Introdu parola ta

source: Environment
ro: Mediu

source: Error
ro: Eroare

source: Error connecting to MetaMask. Please check your wallet.
ro: Eroare la conectarea MetaMask. Verifică portofelul.

source: Error Loading Campaign
ro: Eroare la încărcarea campaniei

source: Error Loading Profile
ro: Eroare la încărcarea profilului

source: ETH Amount
ro: Sumă ETH

source: ETH Amount Range:
ro: Intervalul de sumă ETH:

source: ETH raised
ro: ETH strâns

source: ETH Raised
ro: ETH strâns

source: Every transaction is recorded on the blockchain, ensuring complete transparency and security for all participants.
ro: Fiecare tranzacție este înregistrată pe blockchain, asigurând transparență și securitate completă pentru toți participanții.

source: Experience the next generation of crowdfunding
ro: Experimentează următoarea generație de crowdfunding

source: Explore
ro: Explorează

source: Failed to collect fees
ro: Încasarea comisioanelor a eșuat

source: Failed to connect to MetaMask
ro: Conectare la MetaMask eșuată

source: Failed to connect wallet
ro: Conectare portofel eșuată

source: Failed to create an account. Please try again.
ro: Creare cont eșuată. Încearcă din nou.

source: Failed to create campaign
ro: Creare campanie eșuată

source: Failed to delete campaign
ro: Ștergere campanie eșuată

source: Failed to delete message
ro: Ștergerea mesajului a eșuat

source: Failed to disconnect wallet
ro: Deconectarea portofelului a eșuat

source: Failed to fetch campaign information
ro: Încărcarea informațiilor campaniei a eșuat

source: Failed to load campaign
ro: Încărcarea campaniei a eșuat

source: Failed to load campaigns
ro: Încărcarea campaniilor a eșuat

source: Failed to load messages
ro: Încărcarea mesajelor a eșuat

source: Failed to load profile
ro: Încărcarea profilului a eșuat

source: Failed to load profile data
ro: Încărcarea datelor profilului a eșuat

source: Failed to load wallet
ro: Încărcarea portofelului a eșuat

source: Failed to load your campaigns
ro: Încărcarea campaniilor tale a eșuat

source: Failed to process contribution. Please try again.
ro: Procesarea contribuției a eșuat. Vă rugăm să încercați din nou.

source: Failed to save settings
ro: Salvare setărilor a eșuat

source: Failed to send message
ro: Trimiterea mesajului a eșuat

source: Failed to send message. Please try again later.
ro: Trimiterea mesajului a eșuat. Vă rugăm să încercați din nou mai târziu.

source: Failed to send transaction. Please try again later.
ro: Trimiterea tranzacției a eșuat. Vă rugăm să încercați din nou mai târziu.

source: Failed to update network in database
ro: Actualizarea rețelei în baza de date a eșuat

source: Failed to update password
ro: Actualizarea parolei a eșuat

source: Failed to update profile
ro: Actualizarea profilului a eșuat

source: Failed to withdraw funds. Please try again.
ro: Extragerea fondurilor a eșuat. Vă rugăm să încercați din nou.

source: FAQs
ro: Întrebări frecvente

source: Fashion
ro: Modă

source: Fee Receiver
ro: Beneficiar comisioane

source: Fees collected successfully!
ro: Comisioane încasate cu succes!

source: Fees to Collect
ro: Comisioane de încasat

source: Fill out the form below and we'll get back to you as soon as possible.
ro: Completați formularul de mai jos și vă vom contacta cât mai curând posibil.

source: Food
ro: Mâncare

source: Frequently Asked Questions
ro: Întrebări frecvente

source: From:
ro: De la:

source: Full Description
ro: Descriere completă

source: Funding Goal
ro: Obiectiv de finanțare

source: Funding goal cannot exceed
ro: Obiectivul de finanțare nu poate depăși

source: Funds withdrawn successfully!
ro: Fonduri retrase cu succes!

source: Funds withdrawn successfully. Campaign is now closed.
ro: Fonduri retrase cu succes. Campania este închisă.

source: Games
ro: Jocuri

source: Get in Touch
ro: Contactează-ne

source: Give your campaign a catchy title
ro: Dați titlului campaniei un titlu captivant

source: Global Community
ro: Comunitate globală

source: Go Back
ro: Înapoi

source: Go Home
ro: Acasă

source: goal
ro: obiectiv

source: Goal
ro: obiectiv

source: Goal:
ro: Obiectiv:

source: Health
ro: Sănătate

source: Hide password
ro: Ascunde parola

source: How can we help?
ro: Cu ce vă putem ajuta?

source: Important information about this project
ro: Informații importante despre acest proiect

source: Important Note
ro: Notă importantă

source: Inactive
ro: Inactiv

source: INACTIVE
ro: INACTIV

source: Innovation First
ro: Inovație întâi

source: Install MetaMask
ro: Instalează MetaMask

source: Insufficient balance. Please try again.
ro: Fonduri insuficiente. Vă rugăm să încercați din nou.

source: Invalid email or password. Please try again.
ro: Email sau parolă nevalidă. Vă rugăm să încercați din nou.

source: Invalid Ethereum contract address
ro: Adresă contract Ethereum nevalidă

source: Invalid price data
ro: Date de preț nevalide

source: is applied to all withdrawals.
ro: este aplicată tuturor retragerilor.

source: is applied. This fee helps cover the costs of maintaining the platform and processing transactions.
ro: este aplicată. Acest comision acoperă costurile de menținere a platformei și procesarea tranzacțiilor.

source: Is this a real crowdfunding platform?
ro: Este aceasta o platformă reală de crowdfunding?

source: Join the future of fundraising with blockchain technology. Transparent, secure, and efficient crowdfunding for the digital age.
ro: Alătura-te viitorului crowdfunding cu tehnologia blockchain. Transparent, sigur, și eficient pentru epoca digitală.

source: Launch Campaign
ro: Lansează campania

source: Launch Your Campaign
ro: Lansează campania ta

source: Learn More
ro: Află mai multe

source: Learning Experience
ro: Experiență de învățare

source: Loading blockchain data...
ro: Se încarcă datele blockchain...

source: Loading...
ro: Se încarcă...

source: Local Contract Address
ro: Adresă contract locală

source: Local contract address not configured
ro: Adresa contract locală nu este configurată

source: Local Development Network
ro: Rețea de dezvoltare locală

source: Local Network
ro: Rețea locală

source: Local network settings are for development and testing purposes on this device only. Changes will be applied after page refresh.
ro: Setările rețelei locale sunt pentru scopuri de dezvoltare și testare doar pe acest dispozitiv. Modificările vor fi aplicate după reîncărcarea paginii.

source: Local network settings are stored only on this device.
ro: Setările rețelei locale sunt stocate doar pe acest dispozitiv.

source: Local network settings saved for this device only.
ro: Setările rețelei locale au fost salvate doar pentru acest dispozitiv.

source: Location
ro: Locație

source: Location is limited to
ro: Locația este limitată la

source: Login
ro: Autentificare

source: Mainnet contract address not configured
ro: Adresa contractului Mainnet nu este configurată

source: Make a real difference by supporting projects that matter to you and your community.
ro: Fă o diferență reală susținând proiecte care contează pentru tine și comunitatea ta.

source: Mark all as read
ro: Marchează toate ca citite

source: Maximum contribution is
ro: Suma maximă de contribuție este

source: Menu
ro: Meniu

source: Message
ro: Mesaj

source: Message deleted
ro: Mesaj șters

source: Message sent successfully!
ro: Mesaj trimis cu succes!

source: Message sent successfully! We'll be in touch soon.
ro: Mesaj trimis cu succes! Te vom contacta în curând.

source: MetaMask connection was rejected
ro: Conectarea MetaMask a fost respinsă

source: MetaMask is locked or not connected. Please unlock your wallet.
ro: Portofelul MetaMask este blocat sau nu este conectat. Te rugăm să-l deblochezi.

source: MetaMask is not installed
ro: MetaMask nu este instalat

source: MetaMask is not installed.
ro: MetaMask nu este instalat.

source: MetaMask is not installed. Please install it to use this app.
ro: MetaMask nu este instalat. Te rugăm să îl instalezi pentru a folosi această aplicație.

source: MetaMask is ready to use
ro: MetaMask este gata de utilizare

source: MetaMask Not Installed
ro: MetaMask nu este instalat

source: MetaMask Required
ro: MetaMask necesar

source: MetaMask Wallet
ro: Portofel MetaMask

source: Minimum contribution:
ro: Contribuție minimă:

source: Music
ro: Muzică

source: My Campaigns
ro: Campaniile mele

source: Name
ro: Nume

source: Network cannot be changed after campaign creation
ro: Rețeaua nu poate fi schimbată după crearea campaniei

source: Network settings saved for all users.
ro: Setările rețelei au fost salvate pentru toți utilizatorii

source: Network:
ro: Rețea:

source: New Campaign
ro: Campanie nouă

source: New Password
ro: Parolă nouă

source: New passwords do not match
ro: Noile parole nu coincid

source: Next Step
ro: Pasul următor

source: No {selectedStatus} campaigns
ro: Nu există campanii {selectedStatus}

source: No account found
ro: Nu a fost găsit niciun cont

source: No Campaigns Found
ro: Nu au fost găsite campanii

source: No Campaigns Yet
ro: Nicio campanie deocamdată

source: No campaigns yet on this network
ro: Nu există campanii pe această rețea

source: No fees to collect
ro: Nu există comisioane de încasat

source: No funds available to withdraw.
ro: Nu există fonduri disponibile pentru retragere.

source: No images uploaded
ro: Nu există imagini încărcate

source: No notifications yet
ro: Nu există notificări deocamdată

source: No unread notifications
ro: Nu există notificări necitite

source: No, all campaigns on this platform are fictional and created for demonstration purposes. They do not represent real fundraising initiatives.
ro: Nu, toate campaniile de pe această platformă sunt fictive și create în scop demonstrativ. Ele nu reprezintă inițiative reale de strângere de fonduri.

source: No, BlockFund is not a real crowdfunding platform. This is a school project created for educational purposes only. No real transactions or fundraising activities take place on this platform.
ro: Nu, BlockFund nu este o platformă reală de crowdfunding. Acesta este un proiect școlar creat doar în scopuri educaționale. Pe această platformă nu au loc tranzacții sau activități reale de strângere de fonduri.

source: No, this platform should not be used for real crowdfunding purposes. It is a prototype designed for educational demonstration only. For real crowdfunding, please use established platforms like Kickstarter, GoFundMe, or other legitimate services.
ro: Nu, această platformă nu ar trebui folosită pentru scopuri reale de crowdfunding. Este un prototip creat doar pentru demonstrație educațională. Pentru crowdfunding real, vă rugăm să folosiți platforme consacrate precum Kickstarter, GoFundMe sau alte servicii legitime.

source: Notifications
ro: Notificări

source: of
ro: din

source: On-chain ID
ro: ID pe blockchain

source: Open Source
ro: Sursă deschisă

source: Or
ro: Sau

source: Other
ro: Altele

source: Our support team is spread across the globe to give you the best possible experience.
ro: Echipa noastră de asistență este răspândită la nivel global pentru a vă oferi cea mai bună experiență posibilă.

source: Page Not Found
ro: Pagină negăsită

source: Password
ro: Parolă

source: Password updated successfully
ro: Parolă actualizată cu succes

source: Please complete the following fields:
ro: Te rugăm să completați următoarele câmpuri:

source: Please connect the wallet that created this campaign to delete it.
ro: Te rugăm să conectezi portofelul care a creat această campanie pentru a o șterge.

source: Please connect the wallet that created this campaign to withdraw funds.
ro: Te rugăm să conectezi portofelul care a creat această campanie pentru a retrage fonduri.

source: Please connect your wallet!
ro: Te rugăm să conectezi portofelul!

source: Please enter a campaign ID
ro: Trebuie să introduci un ID de campanie

source: Please enter a valid amount
ro: Te rugăm să introduci o sumă validă

source: Please enter a valid campaign ID
ro: Te rugăm să introduci un ID de campanie valid

source: Please fill in all required fields before previewing
ro: Te rugăm să completați toate câmpurile necesare înainte de a vizualiza

source: Please make sure to withdraw any remaining funds before deleting this campaign.
ro: Te rugăm să îți retragi orice fonduri rămase înainte de a șterge această campanie.

source: Please sign in to contribute to this campaign.
ro: Te rugăm să te autentifici pentru a contribui la această campanie.

source: Please sign in to create a campaign
ro: Te rugăm să te autentifici pentru a crea o campanie

source: Preview
ro: Previzualizare

source: Preview Mode
ro: Mod previzualizare

source: Processing...
ro: Se procesează...

source: Profile
ro: Profil

source: Profile not found
ro: Profil inexistent

source: Profile Settings
ro: Setări profil

source: Profile updated successfully
ro: Profil actualizat cu succes

source: Project Purpose
ro: Scopul proiectului

source: Provide detailed information about your campaign
ro: Cereți informații detaliate despre campania dvs.

source: Provider not initialized
ro: Furnizor neinițializat

source: Publishing
ro: Publicare

source: Quick Links
ro: Linkuri rapide

source: Quick Response Time
ro: Timp de răspuns rapid

source: Reply
ro: Răspuns

source: Resources
ro: Resurse

source: Revolutionize Your
ro: Revoluționează

source: Save Changes
ro: Salvează modificările

source: Save Settings
ro: Salvează setările

source: Saving...
ro: Se salvează...

source: Search campaigns...
ro: Caută campanii...

source: Secure & Transparent
ro: Securizat și transparent

source: Secure Projects
ro: Proiecte sigure

source: Security
ro: Securitate

source: Security Settings
ro: Setări de securitate

source: See how others view your profile
ro: Vezi cum îți vizualizează alții profilul

source: Send
ro: Trimite

source: Send Message
ro: Trimite mesaj

source: Send us a Message
ro: Trimite-ne un mesaj

source: Sending...
ro: Se trimite...

source: Sepolia and Mainnet settings are applied globally for all users.
ro: Setările Sepolia și Mainnet sunt aplicate global pentru toți utilizatorii.

source: Sepolia contract address not configured
ro: Adresa contractului Sepolia nu este configurată

source: Sepolia Test Network
ro: Rețea de test Sepolia

source: Settings
ro: Setări
