Repository: alex-bleotu/BlockFund
Catalog: frontend/src/locales/*/messages.po
Languages: ro

source: settings will be applied globally for all users. This affects where campaigns are deployed and how users interact with the blockchain.
ro: setările vor fi aplicate global pentru toți utilizatorii. Acest lucru afectează unde sunt implementate campaniile și cum utilizatorii interacționează cu blockchain-ul.

source: Show password
ro: Arată parola

source: Sign in
ro: Autentificare

source: Sign in to Contact
ro: Te rugăm să te autentifici pentru a contacta creatorul

source: Sign out
ro: Deconectare

source: Signing in...
ro: Se autentifică...

source: Smart Contracts
ro: Contracte inteligente

source: Social Impact
ro: Impact social

source: Something went wrong. Please try again.
ro: Ceva a mers prost. Te rugăm să încerci din nou.

source: Start a Campaign
ro: Începe o campanie

source: Start Your Campaign
ro: Începe-ți campania

source: Start your first campaign and begin your fundraising journey.
ro: Începe-ți prima campanie și pornește în călătoria ta de strângere de fonduri.

source: start your journey today
ro: începe-ți călătoria astăzi

source: Stay ahead with cutting-edge blockchain technology and innovative funding solutions.
ro: Rămâi cu un pas înainte cu tehnologie blockchain de ultimă oră și soluții inovatoare de finanțare.

source: Story
ro: Poveste

source: Subject
ro: Subiect

source: Success Rate
ro: Rată de succes

source: Summary
ro: Rezumat

source: Summary is limited to
ro: Rezumatul este limitat la

source: Support button will be enabled after campaign launch
ro: Butonul de susținere va fi activat după lansarea campaniei

source: Support this amazing campaign!
ro: Susține această campanie uimitoare!

source: Technology
ro: Tehnologie

source: Technology background
ro: Experiență tehnologică

source: Technology Stack
ro: Stivă tehnologică

source: Tell us about yourself...
ro: Povestește-ne despre tine…

source: Tell us more about your inquiry...
ro: Spune-ne mai multe despre solicitarea ta…

source: The Ethereum address of your locally deployed contract.
ro: Adresa Ethereum a contractului dvs. local implementat.

source: The funding goal cannot be modified after campaign creation
ro: Obiectivul de finanțare nu poate fi modificat după crearea campaniei

source: The goal of BlockFund is to deliver a full-stack dApp where anyone can launch or back a fundraising campaign using MetaMask-enabled wallets. It showcases:
ro: Scopul proiectului este de a livra o aplicație full-stack unde oricine poate lansa sau susține o campanie de strângere de fonduri folosind portofele MetaMask-enable.

source: The page you are looking for doesn't exist or has been moved.
ro: Pagina pe care o cauți nu există sau a fost mutată.

source: The project is open source, allowing others to learn from and contribute to the codebase.
ro: Proiectul este open source, permițând altor oameni să învețe și să contribuie la codul sursă.

source: This action will close the campaign on the blockchain and cannot be undone.
ro: Această acțiune va închide campania pe blockchain și nu poate fi anulată.

source: This campaign has been completed. No further actions are possible.
ro: Această campanie a fost încheiată. Nu sunt posibile alte acțiuni.

source: This campaign has ended.
ro: Această campanie a fost încheiată.

source: This campaign is already closed.
ro: Această campanie este deja închisă.

source: This campaign is deployed on the {0}. Note that the network cannot be changed after campaign creation. Any edits you make will only affect the campaign metadata, not its blockchain configuration.
ro: Această campanie este implementată pe {0}. Rețineți că rețeaua nu poate fi schimbată după crearea campaniei. Orice modificări pe care le faceți vor afecta doar metadata-ul campaniei, nu și configurarea blockchain-ului.

source: This campaign is not active on the blockchain.
ro: Această campanie nu este activă pe blockchain.

source: This campaign will be deployed on the {0}. It will not be visible or accessible from other networks. Make sure your wallet is connected to the correct network before proceeding.
ro: Această campanie va fi implementată pe {0}. Nu va fi vizibilă sau accesibilă din alte rețele. Asigurați-vă că portofelul dvs. este conectat la rețeaua corectă înainte de a continua.

source: This project was built using React, TypeScript, Tailwind CSS, Supabase, and Ethereum smart contracts. It demonstrates the integration of blockchain technology with modern web development practices.
ro: Acest proiect a fost construit folosind React, TypeScript, Tailwind CSS, Supabase și contracte inteligente Ethereum. Demonstrează integrarea tehnologiei blockchain cu practici moderne de dezvoltare web.

source: This project was created as a learning exercise to demonstrate the integration of blockchain technology with modern web development.
ro: Acest proiect a fost creat ca un exercițiu de învățare pentru a demonstra integrarea tehnologiei blockchain cu dezvoltarea web modernă.

source: This project was created as an educational exercise to demonstrate the potential of blockchain technology in crowdfunding. It showcases the integration of Web3 technologies, smart contracts, and modern web development practices.
ro: Acest proiect a fost creat ca un exercițiu educațional pentru a demonstra potențialul tehnologiei blockchain în crowdfunding. Prezintă integrarea tehnologiilor Web3, a contractelor inteligente și a practicilor moderne de dezvoltare web.

source: This username is already taken
ro: Acest nume de utilizator este deja folosit

source: This website is a school project and is not intended for real use. No actual transactions occur, and no real money or cryptocurrency is involved. All features, campaigns, and functionalities are simulated for educational purposes only.
ro: Acest website este un proiect școlar și nu este destinat utilizării reale. Nu se desfășoară tranzacții reale și nu este implicată nicio monedă reală sau criptomonedă. Toate funcționalitățile și campaniile sunt simulate exclusiv în scopuri educaționale.

source: This will allow contributions to your campaign again.
ro: Acesta va permite contribuții la campania dvs.

source: This will prevent further contributions to your campaign.
ro: Acesta va împiedica contribuții suplimentare la campania dvs.

source: Title
ro: Titlu

source: Title is limited to
ro: Titlul este limitat la

source: To create a campaign, you need to have MetaMask installed in your browser. MetaMask allows you to securely manage your cryptocurrency and interact with blockchain applications.
ro: Pentru a crea o campanie, trebuie să aveți MetaMask instalat în browserul dvs. MetaMask vă permite să gestionați în siguranță criptomonedele și să interacționați cu aplicații blockchain.

source: To edit a campaign, you need to have MetaMask installed in your browser. MetaMask allows you to securely manage your cryptocurrency and interact with blockchain applications.
ro: Pentru a edita o campanie, trebuie să aveți MetaMask instalat în browserul dvs. MetaMask vă permite să gestionați în siguranță criptomonedele și să interacționați cu aplicații blockchain.

source: Toggle theme
ro: Schimbă tema

source: Top Active Campaigns
ro: Top campanii active

source: Total Raised
ro: Total strâns

source: Transaction declined: You cancelled the MetaMask transaction
ro: Tranzacția a fost respinsă: Ați anulat tranzacția MetaMask

source: Transaction in progress...
ro: Tranzacția se procesează...

source: Transaction rejected: You declined the MetaMask transaction
ro: Tranzacția a fost respinsă: Ați anulat tranzacția MetaMask

source: Type your message here...
ro: Scrieți mesajul aici...

source: Type your reply...
ro: Scrieți răspunsul aici...

source: Unknown
ro: Necunoscut

source: Unknown User
ro: Utilizator necunoscut

source: Unread
ro: Necitite

source: Update Password
ro: Actualizează parola

source: Updating...
ro: Se actualizează...

source: USD Amount
ro: Sumă USD

source: Username
ro: Nume utilizator

source: Username cannot contain spaces
ro: Nume utilizator nu poate conține spații

source: Using estimated ETH price
ro: Se folosește prețul estimat ETH

source: View Profile
ro: Vezi profilul

source: View Public Profile
ro: Vezi profilul public

source: Visit Us
ro: Vizitează-ne

source: Wallet
ro: Portofel

source: Wallet connected successfully!
ro: Portofel conectat cu succes!

source: Wallet Connection
ro: Conectare portofel

source: Wallet disconnected successfully
ro: Portofel deconectat cu succes

source: We typically respond within 2-3 business hours during our working hours.
ro: De obicei, răspundem în decurs de 2-3 ore lucrătoare în timpul programului nostru.

source: We'll notify you when something happens
ro: Vom vă informa când se întâmplă ceva

source: Welcome back
ro: Bine ai revenit

source: What is the purpose of this project?
ro: Care este scopul acestui proiect?

source: What is the withdrawal fee?
ro: Care este comisionul de retragere?

source: What technologies were used?
ro: Ce tehnologii au fost folosite?

source: When withdrawing funds from a campaign, a platform fee of
ro: Când retragi fonduri dintr-o campanie, este aplicat un comision de platformă de

source: Where is your campaign based?
ro: Unde este bazată campania ta?

source: Why Choose BlockFund?
ro: De ce să alegi BlockFund?

source: Withdraw
ro: Retragere

source: Withdraw Funds
ro: Retragere fonduri

source: Withdraw funds to close this campaign.
ro: Retragere fonduri pentru a închide această campanie.

source: Withdrawal Fee
ro: Comision de retragere

source: Withdrawal successful but failed to update campaign data
ro: Retragerea a avut succes, dar nu a putut actualiza datele campaniei

source: Withdrawal successful but failed to update database records
ro: Retragerea a avut succes, dar nu a putut actualiza datele în baza de date

source: Withdrawing funds will close this campaign permanently. This action cannot be undone.
ro: Retragerea fondurilor va închide această campanie permanent. Această acțiune nu poate fi anulată.

source: Worldwide Access
ro: Acces la nivel mondial

source: Write a brief summary of your campaign
ro: Scrieți un rezumat scurt al campaniei dvs.

source: Yes, while the campaigns themselves are fictional, the donation flow is live. When you donate, real cryptocurrency is sent from your connected wallet to the campaign's specified address. Use testnet funds only, as this remains a demo environment.
ro: Da, deși campaniile în sine sunt fictive, fluxul de donație este activ. Când donezi, criptomonede reale sunt trimise din portofelul tău conectat către adresa specificată a campaniei. Folosește doar fonduri din testnet, deoarece acesta rămâne un mediu demonstrativ.

source: You are the creator
ro: Tu ești creatorul

source: You don't have any ended campaigns yet.
ro: Nu ai încă campanii încheiate.

source: You need to connect your wallet to create a new campaign. This allows you to receive funds and manage your campaign securely.
ro: Trebuie să conectezi portofelul dvs. pentru a crea o nouă campanie. Acesta vă permite să primiți fonduri și să gestionați campania în siguranță.

source: You need to connect your wallet to edit your campaign. This allows you to receive funds and manage your campaign securely.
ro: Trebuie să conectezi portofelul dvs. pentru a edita campania. Acesta vă permite să primiți fonduri și să gestionați campania în siguranță.

source: You rejected the transaction. Please try again.
ro: Ați respins tranzacția. Vă rugăm să încercați din nou.

source: You will receive:
ro: Veți primi:

source: Your Contribution
ro: Contribuția ta
